{
  "documents": [
    {
      "id": "doc_001",
      "title": "Пословицы о труде",
      "text": "Без труда не выловишь и рыбку из пруда. Терпение и труд все перетрут. Дело мастера боится. Кто не работает, тот не ест. Работа не волк, в лес не убежит.",
      "author": "Народная мудрость",
      "ts": "2024-01-15T10:00:00Z"
    },
    {
      "id": "doc_002",
      "title": "О дружбе и взаимопомощи",
      "text": "Друг познается в беде. Старый друг лучше новых двух. Не имей сто рублей, а имей сто друзей. Дружба дружбой, а служба службой. Друзья познаются в беде.",
      "author": "Народная мудрость", 
      "ts": "2024-01-16T11:00:00Z"
    },
    {
      "id": "doc_003",
      "title": "Мудрые изречения о знании",
      "text": "Знание - сила. Ученье - свет, а неученье - тьма. Повторение - мать учения. Век живи - век учись. Что посеешь, то и пожнешь.",
      "author": "Народная мудрость",
      "ts": "2024-01-17T12:00:00Z"
    },
    {
      "id": "doc_004", 
      "title": "Цитаты великих людей о жизни",
      "text": "Жизнь прекрасна, если знаешь, что с ней делать. Главное - не переставать задавать вопросы. Будь собой, остальные роли уже заняты. Жизнь - это то, что с тобой происходит, пока ты строишь планы.",
      "author": "Альберт Эйнштейн, Оскар Уайльд",
      "ts": "2024-01-18T13:00:00Z"
    },
    {
      "id": "doc_005",
      "title": "О времени и планировании",
      "text": "Время - деньги. Не откладывай на завтра то, что можешь сделать сегодня. Лучше поздно, чем никогда. Тише едешь - дальше будешь. Семь раз отмерь, один раз отрежь.",
      "author": "Деловая мудрость",
      "ts": "2024-01-19T14:00:00Z"
    },
    {
      "id": "doc_006",
      "title": "Принципы программирования",
      "text": "Код должен быть читаемым. Простота - высшая степень изощренности. Преждевременная оптимизация - корень всех зол. Любую проблему в программировании можно решить добавлением еще одного уровня абстракции.",
      "author": "Дональд Кнут, Леонардо да Винчи",
      "ts": "2024-01-20T15:00:00Z"
    },
    {
      "id": "doc_007",
      "title": "Основы функционального программирования",
      "text": "Функциональное программирование основано на математических принципах. Чистые функции не имеют побочных эффектов. Иммутабельность данных упрощает отладку. Композиция функций позволяет строить сложную логику из простых блоков.",
      "author": "Учебник по ФП",
      "ts": "2024-01-21T16:00:00Z"
    },
    {
      "id": "doc_008",
      "title": "Алгоритмы и структуры данных",
      "text": "Выбор правильной структуры данных определяет эффективность алгоритма. Массивы обеспечивают быстрый доступ по индексу. Связанные списки эффективны для вставки и удаления. Деревья позволяют быстро искать и сортировать данные.",
      "author": "Роберт Седжвик",
      "ts": "2024-01-22T17:00:00Z"
    },
    {
      "id": "doc_009",
      "title": "Принципы SOLID",
      "text": "Single Responsibility - каждый класс должен иметь только одну причину для изменения. Open-Closed - классы должны быть открыты для расширения, но закрыты для модификации. Liskov Substitution - объекты должны быть заменяемы экземплярами их подтипов.",
      "author": "Роберт Мартин",
      "ts": "2024-01-23T18:00:00Z"
    },
    {
      "id": "doc_010",
      "title": "Базы данных и нормализация",
      "text": "Нормализация устраняет дублирование данных. Первая нормальная форма требует атомарности значений. Вторая нормальная форма исключает частичные зависимости. Третья нормальная форма устраняет транзитивные зависимости.",
      "author": "Эдгар Кодд",
      "ts": "2024-01-24T19:00:00Z"
    },
    {
      "id": "doc_011",
      "title": "Тестирование программного обеспечения",
      "text": "Модульные тесты проверяют отдельные компоненты. Интеграционные тесты проверяют взаимодействие модулей. Системные тесты проверяют всю систему целиком. Пирамида тестирования: много модульных, меньше интеграционных, минимум системных тестов.",
      "author": "Мартин Фаулер",
      "ts": "2024-01-25T20:00:00Z"
    },
    {
      "id": "doc_012",
      "title": "Паттерны проектирования",
      "text": "Singleton обеспечивает единственный экземпляр класса. Factory создает объекты без указания их конкретных классов. Observer уведомляет множество объектов об изменении состояния. Strategy позволяет выбирать алгоритм во время выполнения.",
      "author": "Банда четырех",
      "ts": "2024-01-26T21:00:00Z"
    },
    {
      "id": "doc_013",
      "title": "Основы кибербезопасности",
      "text": "Парольная политика должна требовать сложные пароли. Двухфакторная аутентификация повышает безопасность. Шифрование защищает данные при передаче и хранении. Регулярные обновления закрывают уязвимости системы.",
      "author": "Брюс Шнайер",
      "ts": "2024-01-27T22:00:00Z"
    },
    {
      "id": "doc_014",
      "title": "Машинное обучение",
      "text": "Supervised learning использует размеченные данные для обучения. Unsupervised learning находит скрытые закономерности в данных. Neural networks моделируют работу человеческого мозга. Deep learning использует глубокие нейронные сети для сложных задач.",
      "author": "Эндрю Нг",
      "ts": "2024-01-28T23:00:00Z"
    },
    {
      "id": "doc_015",
      "title": "Математические основы программирования",
      "text": "Дискретная математика изучает счетные структуры. Теория графов применяется для решения сетевых задач. Линейная алгебра необходима для машинного обучения. Теория вероятностей помогает в анализе алгоритмов.",
      "author": "Дональд Кнут",
      "ts": "2024-01-29T10:00:00Z"
    },
    {
      "id": "doc_016",
      "title": "Веб-разработка",
      "text": "HTML определяет структуру веб-страницы. CSS отвечает за внешний вид и стили. JavaScript добавляет интерактивность. React создает компонентные пользовательские интерфейсы.",
      "author": "MDN Web Docs",
      "ts": "2024-01-30T11:00:00Z"
    },
    {
      "id": "doc_017",
      "title": "Мобильная разработка",
      "text": "Native приложения используют платформенные технологии. Cross-platform решения работают на разных платформах. React Native позволяет писать мобильные приложения на JavaScript. Flutter использует язык Dart для создания красивых интерфейсов.",
      "author": "Google Developers",
      "ts": "2024-01-31T12:00:00Z"
    },
    {
      "id": "doc_018",
      "title": "DevOps и автоматизация",
      "text": "CI/CD автоматизирует процесс разработки и развертывания. Docker контейнеризирует приложения. Kubernetes оркестрирует контейнеры в кластере. Infrastructure as Code описывает инфраструктуру в виде кода.",
      "author": "DevOps Institute",
      "ts": "2024-02-01T13:00:00Z"
    },
    {
      "id": "doc_019",
      "title": "Облачные технологии",
      "text": "IaaS предоставляет виртуальную инфраструктуру. PaaS предлагает платформу для разработки приложений. SaaS доставляет готовое программное обеспечение. Serverless позволяет запускать код без управления серверами.",
      "author": "Amazon AWS",
      "ts": "2024-02-02T14:00:00Z"
    },
    {
      "id": "doc_020",
      "title": "Искусственный интеллект",
      "text": "Экспертные системы имитируют принятие решений экспертом. Генетические алгоритмы используют принципы эволюции. Нечеткая логика работает с неопределенными данными. Computer vision позволяет компьютерам понимать изображения.",
      "author": "Стюарт Рассел",
      "ts": "2024-02-03T15:00:00Z"
    },
    {
      "id": "doc_021",
      "title": "Блокчейн и криптовалюты",
      "text": "Блокчейн - это распределенная база данных. Майнинг обеспечивает безопасность сети. Smart contracts автоматизируют выполнение соглашений. DeFi создает децентрализованные финансовые сервисы.",
      "author": "Сатоши Накамото",
      "ts": "2024-02-04T16:00:00Z"
    },
    {
      "id": "doc_022",
      "title": "Управление проектами",
      "text": "Waterfall - последовательная модель разработки. Agile предполагает итеративную разработку. Scrum организует работу командами в спринтах. Kanban визуализирует поток задач.",
      "author": "Project Management Institute",
      "ts": "2024-02-05T17:00:00Z"
    },
    {
      "id": "doc_023",
      "title": "Философия программирования",
      "text": "Код должен быть выразительным и самодокументируемым. Принцип DRY - не повторяйся. KISS - делай проще. YAGNI - тебе это не понадобится. Рефакторинг улучшает структуру кода без изменения функциональности.",
      "author": "Роберт Мартин",
      "ts": "2024-02-06T18:00:00Z"
    },
    {
      "id": "doc_024",
      "title": "Сетевые протоколы",
      "text": "HTTP - протокол передачи гипертекста. TCP обеспечивает надежную доставку данных. UDP быстрее TCP, но менее надежен. DNS преобразует доменные имена в IP-адреса.",
      "author": "RFC Standards",
      "ts": "2024-02-07T19:00:00Z"
    },
    {
      "id": "doc_025",
      "title": "Операционные системы",
      "text": "Планировщик задач распределяет процессорное время. Менеджер памяти управляет оперативной памятью. Файловая система организует хранение данных на диске. Драйверы обеспечивают взаимодействие с оборудованием.",
      "author": "Эндрю Таненбаум",
      "ts": "2024-02-08T20:00:00Z"
    },
    {
      "id": "doc_026",
      "title": "Компьютерные сети",
      "text": "Модель OSI описывает семь уровней сетевого взаимодействия. Ethernet - стандарт локальных сетей. Wi-Fi обеспечивает беспроводную связь. VPN создает защищенное соединение через интернет.",
      "author": "Cisco Systems",
      "ts": "2024-02-09T21:00:00Z"
    },
    {
      "id": "doc_027",
      "title": "Архитектура компьютера",
      "text": "Процессор выполняет инструкции программ. Оперативная память хранит данные во время работы. Кэш ускоряет доступ к часто используемым данным. Конвейер позволяет выполнять несколько инструкций одновременно.",
      "author": "Дэвид Паттерсон",
      "ts": "2024-02-10T22:00:00Z"
    },
    {
      "id": "doc_028",
      "title": "Теория сложности",
      "text": "Big O описывает скорость роста функции. P-класс содержит задачи, решаемые за полиномиальное время. NP-класс содержит задачи, проверяемые за полиномиальное время. NP-полные задачи являются самыми сложными в NP.",
      "author": "Стивен Кук",
      "ts": "2024-02-11T23:00:00Z"
    },
    {
      "id": "doc_029",
      "title": "Графические интерфейсы",
      "text": "UX дизайн фокусируется на опыте пользователя. UI дизайн создает визуальные элементы интерфейса. Usability testing проверяет удобство использования. A/B тестирование сравнивает разные варианты дизайна.",
      "author": "Дон Норман",
      "ts": "2024-02-12T10:00:00Z"
    },
    {
      "id": "doc_030",
      "title": "История вычислительной техники",
      "text": "ENIAC был одним из первых электронных компьютеров. Транзистор заменил электронные лампы. Микропроцессоры позволили создать персональные компьютеры. Интернет соединил компьютеры по всему миру.",
      "author": "Музей компьютерной истории",
      "ts": "2024-02-13T11:00:00Z"
    }
  ],
  "users": [
    {"id": "user_001", "name": "Петров Александр Иванович"},
    {"id": "user_002", "name": "Сидорова Мария Петровна"},
    {"id": "user_003", "name": "Козлов Дмитрий Александрович"},
    {"id": "user_004", "name": "Новикова Елена Сергеевна"},
    {"id": "user_005", "name": "Морозов Андрей Викторович"},
    {"id": "user_006", "name": "Лебедева Ольга Николаевна"},
    {"id": "user_007", "name": "Васильев Сергей Анатольевич"},
    {"id": "user_008", "name": "Федорова Татьяна Владимировна"},
    {"id": "user_009", "name": "Михайлов Игорь Дмитриевич"},
    {"id": "user_010", "name": "Смирнова Анна Михайловна"},
    {"id": "user_011", "name": "Кузнецов Павел Сергеевич"},
    {"id": "user_012", "name": "Попова Наталья Александровна"},
    {"id": "user_013", "name": "Соколов Максим Владимирович"},
    {"id": "user_014", "name": "Захарова Светлана Игоревна"},
    {"id": "user_015", "name": "Борисов Алексей Николаевич"},
    {"id": "user_016", "name": "Григорьева Юлия Дмитриевна"},
    {"id": "user_017", "name": "Романов Владислав Андреевич"},
    {"id": "user_018", "name": "Степанова Екатерина Павловна"},
    {"id": "user_019", "name": "Макаров Артем Сергеевич"},
    {"id": "user_020", "name": "Орлова Валентина Алексеевна"}
  ],
  "submissions": [
    {
      "id": "sub_001",
      "user_id": "user_001",
      "text": "Без усилий невозможно достичь результата. Трудолюбие и настойчивость преодолевают любые препятствия.",
      "ts": "2024-03-01T10:00:00Z"
    },
    {
      "id": "sub_002",
      "user_id": "user_002", 
      "text": "Настоящий товарищ проявляет себя в трудную минуту. Верная дружба ценнее материальных благ.",
      "ts": "2024-03-01T11:00:00Z"
    },
    {
      "id": "sub_003",
      "user_id": "user_003",
      "text": "Образование - это ключ к успеху. Постоянное обучение расширяет горизонты мышления.",
      "ts": "2024-03-01T12:00:00Z"
    },
    {
      "id": "sub_004",
      "user_id": "user_004",
      "text": "Жизнь становится прекрасной, когда находишь свое предназначение. Важно оставаться верным себе.",
      "ts": "2024-03-01T13:00:00Z"
    },
    {
      "id": "sub_005",
      "user_id": "user_005",
      "text": "Эффективное планирование экономит время и ресурсы. Своевременные действия предотвращают проблемы.",
      "ts": "2024-03-01T14:00:00Z"
    },
    {
      "id": "sub_006",
      "user_id": "user_006",
      "text": "Чистый код - основа качественного программного обеспечения. Простые решения часто оказываются лучшими.",
      "ts": "2024-03-01T15:00:00Z"
    },
    {
      "id": "sub_007",
      "user_id": "user_007",
      "text": "Функциональный подход упрощает разработку сложных систем. Неизменяемые структуры данных повышают надежность.",
      "ts": "2024-03-01T16:00:00Z"
    },
    {
      "id": "sub_008",
      "user_id": "user_008",
      "text": "Правильный выбор алгоритма критически важен для производительности. Структуры данных влияют на эффективность операций.",
      "ts": "2024-03-01T17:00:00Z"
    },
    {
      "id": "sub_009",
      "user_id": "user_009",
      "text": "Принципы SOLID помогают создавать поддерживаемый код. Каждый компонент должен иметь четкую ответственность.",
      "ts": "2024-03-01T18:00:00Z"
    },
    {
      "id": "sub_010",
      "user_id": "user_010",
      "text": "Нормализация базы данных устраняет избыточность информации. Атомарность полей обеспечивает целостность данных.",
      "ts": "2024-03-01T19:00:00Z"
    },
    {
      "id": "sub_011",
      "user_id": "user_011",
      "text": "Автоматизированное тестирование гарантирует качество продукта. Пирамида тестов оптимизирует затраты на проверку.",
      "ts": "2024-03-01T20:00:00Z"
    },
    {
      "id": "sub_012",
      "user_id": "user_012",
      "text": "Шаблоны проектирования предоставляют проверенные решения. Правильное применение паттернов упрощает архитектуру.",
      "ts": "2024-03-01T21:00:00Z"
    },
    {
      "id": "sub_013",
      "user_id": "user_013",
      "text": "Информационная безопасность требует комплексного подхода. Многоуровневая защита минимизирует риски утечек.",
      "ts": "2024-03-01T22:00:00Z"
    },
    {
      "id": "sub_014",
      "user_id": "user_014",
      "text": "Машинное обучение революционизирует анализ данных. Нейронные сети способны решать сложные задачи распознавания.",
      "ts": "2024-03-01T23:00:00Z"
    },
    {
      "id": "sub_015",
      "user_id": "user_015",
      "text": "Математические методы лежат в основе программирования. Дискретная математика особенно важна для алгоритмов.",
      "ts": "2024-03-02T10:00:00Z"
    },
    {
      "id": "sub_016",
      "user_id": "user_016",
      "text": "Современная веб-разработка требует знания множества технологий. Компонентный подход упрощает создание интерфейсов.",
      "ts": "2024-03-02T11:00:00Z"
    },
    {
      "id": "sub_017",
      "user_id": "user_017",
      "text": "Кроссплатформенная разработка экономит ресурсы компании. Единая кодовая база сокращает время выхода на рынок.",
      "ts": "2024-03-02T12:00:00Z"
    },
    {
      "id": "sub_018",
      "user_id": "user_018",
      "text": "DevOps практики ускоряют доставку программного обеспечения. Контейнеризация упрощает развертывание приложений.",
      "ts": "2024-03-02T13:00:00Z"
    },
    {
      "id": "sub_019",
      "user_id": "user_019",
      "text": "Облачные сервисы предоставляют масштабируемую инфраструктуру. Serverless архитектура снижает операционные затраты.",
      "ts": "2024-03-02T14:00:00Z"
    },
    {
      "id": "sub_020",
      "user_id": "user_020",
      "text": "Искусственный интеллект трансформирует множество отраслей. Компьютерное зрение находит применение в автономных системах.",
      "ts": "2024-03-02T15:00:00Z"
    },
    {
      "id": "sub_021",
      "user_id": "user_001",
      "text": "Распределенные реестры обеспечивают прозрачность транзакций. Умные контракты автоматизируют бизнес-процессы без посредников.",
      "ts": "2024-03-02T16:00:00Z"
    },
    {
      "id": "sub_022",
      "user_id": "user_002",
      "text": "Гибкие методологии адаптируются к изменяющимся требованиям. Визуализация рабочего процесса повышает эффективность команды.",
      "ts": "2024-03-02T17:00:00Z"
    },
    {
      "id": "sub_023",
      "user_id": "user_003",
      "text": "Качественный код должен легко читаться и пониматься. Рефакторинг поддерживает архитектуру в чистом состоянии.",
      "ts": "2024-03-02T18:00:00Z"
    },
    {
      "id": "sub_024",
      "user_id": "user_004",
      "text": "Сетевые протоколы обеспечивают обмен данными между системами. Надежность передачи критична для распределенных приложений.",
      "ts": "2024-03-02T19:00:00Z"
    },
    {
      "id": "sub_025",
      "user_id": "user_005",
      "text": "Операционная система управляет ресурсами компьютера. Эффективное планирование задач максимизирует производительность системы.",
      "ts": "2024-03-02T20:00:00Z"
    },
    {
      "id": "sub_026",
      "user_id": "user_006",
      "text": "Сетевая архитектура определяет способ взаимодействия устройств. Беспроводные технологии обеспечивают мобильность пользователей.",
      "ts": "2024-03-02T21:00:00Z"
    },
    {
      "id": "sub_027",
      "user_id": "user_007",
      "text": "Архитектура процессора влияет на скорость выполнения программ. Кэширование данных значительно ускоряет вычисления.",
      "ts": "2024-03-02T22:00:00Z"
    },
    {
      "id": "sub_028",
      "user_id": "user_008",
      "text": "Анализ сложности алгоритмов помогает выбрать оптимальное решение. Классификация задач по сложности направляет исследования.",
      "ts": "2024-03-02T23:00:00Z"
    },
    {
      "id": "sub_029",
      "user_id": "user_009",
      "text": "Пользовательский интерфейс должен быть интуитивно понятным. Тестирование юзабилити выявляет проблемы взаимодействия.",
      "ts": "2024-03-03T10:00:00Z"
    },
    {
      "id": "sub_030",
      "user_id": "user_010",
      "text": "История компьютерных технологий показывает путь развития отрасли. Каждое поколение компьютеров открывало новые возможности.",
      "ts": "2024-03-03T11:00:00Z"
    },
    {
      "id": "sub_031",
      "user_id": "user_011",
      "text": "Терпение и работа превосходят любые препятствия в достижении цели.",
      "ts": "2024-03-03T12:00:00Z"
    },
    {
      "id": "sub_032",
      "user_id": "user_012",
      "text": "Истинные друзья всегда поддержат в трудной жизненной ситуации.",
      "ts": "2024-03-03T13:00:00Z"
    },
    {
      "id": "sub_033",
      "user_id": "user_013",
      "text": "Обучение - это источник силы и просвещения для человека.",
      "ts": "2024-03-03T14:00:00Z"
    },
    {
      "id": "sub_034",
      "user_id": "user_014",
      "text": "Существование приобретает смысл через понимание своего пути.",
      "ts": "2024-03-03T15:00:00Z"
    },
    {
      "id": "sub_035",
      "user_id": "user_015",
      "text": "Правильное управление временем является ключом к эффективности.",
      "ts": "2024-03-03T16:00:00Z"
    },
    {
      "id": "sub_036",
      "user_id": "user_016",
      "text": "Понятный программный код облегчает сопровождение и развитие системы.",
      "ts": "2024-03-03T17:00:00Z"
    },
    {
      "id": "sub_037",
      "user_id": "user_017",
      "text": "Математические принципы составляют фундамент функционального программирования.",
      "ts": "2024-03-03T18:00:00Z"
    },
    {
      "id": "sub_038",
      "user_id": "user_018",
      "text": "Выбор подходящей структуры данных критичен для эффективности программы.",
      "ts": "2024-03-03T19:00:00Z"
    },
    {
      "id": "sub_039",
      "user_id": "user_019",
      "text": "Архитектурные принципы способствуют созданию качественного программного обеспечения.",
      "ts": "2024-03-03T20:00:00Z"
    },
    {
      "id": "sub_040",
      "user_id": "user_020",
      "text": "Структурирование базы данных исключает дублирование информации.",
      "ts": "2024-03-03T21:00:00Z"
    },
    {
      "id": "sub_041",
      "user_id": "user_001",
      "text": "Систематическое тестирование обеспечивает надежность программного продукта.",
      "ts": "2024-03-03T22:00:00Z"
    },
    {
      "id": "sub_042",
      "user_id": "user_002",
      "text": "Архитектурные шаблоны предлагают испытанные подходы к решению задач.",
      "ts": "2024-03-03T23:00:00Z"
    },
    {
      "id": "sub_043",
      "user_id": "user_003",
      "text": "Защита информации нуждается в системном и всестороннем подходе.",
      "ts": "2024-03-04T10:00:00Z"
    },
    {
      "id": "sub_044",
      "user_id": "user_004",
      "text": "Алгоритмы обучения трансформируют подходы к обработке информации.",
      "ts": "2024-03-04T11:00:00Z"
    },
    {
      "id": "sub_045",
      "user_id": "user_005",
      "text": "Фундаментальная математика необходима для понимания алгоритмов.",
      "ts": "2024-03-04T12:00:00Z"
    },
    {
      "id": "sub_046",
      "user_id": "user_006",
      "text": "Интернет-технологии требуют освоения различных инструментов и фреймворков.",
      "ts": "2024-03-04T13:00:00Z"
    },
    {
      "id": "sub_047",
      "user_id": "user_007",
      "text": "Универсальные решения для мобильных платформ оптимизируют разработку.",
      "ts": "2024-03-04T14:00:00Z"
    },
    {
      "id": "sub_048",
      "user_id": "user_008",
      "text": "Методологии DevOps интегрируют процессы разработки и эксплуатации.",
      "ts": "2024-03-04T15:00:00Z"
    },
    {
      "id": "sub_049",
      "user_id": "user_009",
      "text": "Виртуальная инфраструктура обеспечивает гибкость и масштабируемость.",
      "ts": "2024-03-04T16:00:00Z"
    },
    {
      "id": "sub_050",
      "user_id": "user_010",
      "text": "Интеллектуальные системы применяют алгоритмы для решения сложных проблем.",
      "ts": "2024-03-04T17:00:00Z"
    },
    {
      "id": "sub_051",
      "user_id": "user_011",
      "text": "Технология распределенных реестров гарантирует целостность данных.",
      "ts": "2024-03-04T18:00:00Z"
    },
    {
      "id": "sub_052",
      "user_id": "user_012",
      "text": "Итеративные подходы к управлению проектами повышают адаптивность.",
      "ts": "2024-03-04T19:00:00Z"
    },
    {
      "id": "sub_053",
      "user_id": "user_013",
      "text": "Философия разработки подчеркивает важность чистоты и простоты кода.",
      "ts": "2024-03-04T20:00:00Z"
    },
    {
      "id": "sub_054",
      "user_id": "user_014",
      "text": "Коммуникационные протоколы стандартизируют обмен информацией.",
      "ts": "2024-03-04T21:00:00Z"
    },
    {
      "id": "sub_055",
      "user_id": "user_015",
      "text": "Системное программное обеспечение координирует работу аппаратных компонентов.",
      "ts": "2024-03-04T22:00:00Z"
    },
    {
      "id": "sub_056",
      "user_id": "user_016",
      "text": "Топология сети определяет принципы соединения вычислительных устройств.",
      "ts": "2024-03-04T23:00:00Z"
    },
    {
      "id": "sub_057",
      "user_id": "user_017",
      "text": "Микроархитектура процессора влияет на производительность вычислений.",
      "ts": "2024-03-05T10:00:00Z"
    },
    {
      "id": "sub_058",
      "user_id": "user_018",
      "text": "Вычислительная сложность определяет практическую применимость алгоритмов.",
      "ts": "2024-03-05T11:00:00Z"
    },
    {
      "id": "sub_059",
      "user_id": "user_019",
      "text": "Дизайн взаимодействия создает положительный пользовательский опыт.",
      "ts": "2024-03-05T12:00:00Z"
    },
    {
      "id": "sub_060",
      "user_id": "user_020",
      "text": "Эволюция компьютерной техники демонстрирует непрерывный технологический прогресс.",
      "ts": "2024-03-05T13:00:00Z"
    },
    {
      "id": "sub_061",
      "user_id": "user_001",
      "text": "Упорный труд и постоянство приводят к желаемым результатам.",
      "ts": "2024-03-05T14:00:00Z"
    },
    {
      "id": "sub_062",
      "user_id": "user_002",
      "text": "Надежный спутник жизни проявляет себя в момент испытаний.",
      "ts": "2024-03-05T15:00:00Z"
    },
    {
      "id": "sub_063",
      "user_id": "user_003",
      "text": "Непрерывное образование - путь к личностному развитию и росту.",
      "ts": "2024-03-05T16:00:00Z"
    },
    {
      "id": "sub_064",
      "user_id": "user_004",
      "text": "Жизнь обретает красоту через познание собственного предназначения.",
      "ts": "2024-03-05T17:00:00Z"
    },
    {
      "id": "sub_065",
      "user_id": "user_005",
      "text": "Грамотное распределение времени - основа продуктивной деятельности.",
      "ts": "2024-03-05T18:00:00Z"
    },
    {
      "id": "sub_066",
      "user_id": "user_006",
      "text": "Читаемость программного кода - признак профессионального мастерства.",
      "ts": "2024-03-05T19:00:00Z"
    },
    {
      "id": "sub_067",
      "user_id": "user_007",
      "text": "Функциональная парадигма базируется на принципах математической логики.",
      "ts": "2024-03-05T20:00:00Z"
    },
    {
      "id": "sub_068",
      "user_id": "user_008",
      "text": "Оптимальный алгоритм зависит от правильного выбора структуры данных.",
      "ts": "2024-03-05T21:00:00Z"
    },
    {
      "id": "sub_069",
      "user_id": "user_009",
      "text": "Принципы качественной архитектуры обеспечивают долгосрочную поддержку системы.",
      "ts": "2024-03-05T22:00:00Z"
    },
    {
      "id": "sub_070",
      "user_id": "user_010",
      "text": "Правильная организация данных предотвращает информационную избыточность.",
      "ts": "2024-03-05T23:00:00Z"
    },
    {
      "id": "sub_071",
      "user_id": "user_011",
      "text": "Комплексное тестирование гарантирует стабильность программного решения.",
      "ts": "2024-03-06T10:00:00Z"
    },
    {
      "id": "sub_072",
      "user_id": "user_012",
      "text": "Проектные шаблоны содержат проверенные временем архитектурные решения.",
      "ts": "2024-03-06T11:00:00Z"
    },
    {
      "id": "sub_073",
      "user_id": "user_013",
      "text": "Многоуровневая система безопасности защищает от различных угроз.",
      "ts": "2024-03-06T12:00:00Z"
    },
    {
      "id": "sub_074",
      "user_id": "user_014",
      "text": "Технологии искусственного интеллекта преобразуют способы анализа данных.",
      "ts": "2024-03-06T13:00:00Z"
    },
    {
      "id": "sub_075",
      "user_id": "user_015",
      "text": "Теоретические основы математики поддерживают алгоритмическое мышление.",
      "ts": "2024-03-06T14:00:00Z"
    },
    {
      "id": "sub_076",
      "user_id": "user_016",
      "text": "Разработка веб-приложений включает освоение множественных технологий.",
      "ts": "2024-03-06T15:00:00Z"
    },
    {
      "id": "sub_077",
      "user_id": "user_017",
      "text": "Мультиплатформенные решения сокращают временные затраты на разработку.",
      "ts": "2024-03-06T16:00:00Z"
    },
    {
      "id": "sub_078",
      "user_id": "user_018",
      "text": "Автоматизация процессов разработки повышает скорость доставки продукта.",
      "ts": "2024-03-06T17:00:00Z"
    },
    {
      "id": "sub_079",
      "user_id": "user_019",
      "text": "Облачные платформы предоставляют масштабируемые вычислительные ресурсы.",
      "ts": "2024-03-06T18:00:00Z"
    },
    {
      "id": "sub_080",
      "user_id": "user_020",
      "text": "Системы машинного интеллекта решают задачи в различных предметных областях.",
      "ts": "2024-03-06T19:00:00Z"
    },
    {
      "id": "sub_081",
      "user_id": "user_001",
      "text": "Блокчейн обеспечивает прозрачность и неизменность записей транзакций.",
      "ts": "2024-03-06T20:00:00Z"
    },
    {
      "id": "sub_082",
      "user_id": "user_002",
      "text": "Agile методологии адаптируются к изменяющимся потребностям бизнеса.",
      "ts": "2024-03-06T21:00:00Z"
    },
    {
      "id": "sub_083",
      "user_id": "user_003",
      "text": "Культура качественного кода подчеркивает значимость поддерживаемости.",
      "ts": "2024-03-06T22:00:00Z"
    },
    {
      "id": "sub_084",
      "user_id": "user_004",
      "text": "Стандартизированные протоколы обеспечивают совместимость систем связи.",
      "ts": "2024-03-06T23:00:00Z"
    },
    {
      "id": "sub_085",
      "user_id": "user_005",
      "text": "Операционная система выполняет роль посредника между программами и оборудованием.",
      "ts": "2024-03-07T10:00:00Z"
    },
    {
      "id": "sub_086",
      "user_id": "user_006",
      "text": "Сетевая инфраструктура определяет способы взаимодействия удаленных систем.",
      "ts": "2024-03-07T11:00:00Z"
    },
    {
      "id": "sub_087",
      "user_id": "user_007",
      "text": "Архитектурные особенности процессора определяют скорость обработки команд.",
      "ts": "2024-03-07T12:00:00Z"
    },
    {
      "id": "sub_088",
      "user_id": "user_008",
      "text": "Классификация алгоритмов по сложности направляет выбор оптимального решения.",
      "ts": "2024-03-07T13:00:00Z"
    },
    {
      "id": "sub_089",
      "user_id": "user_009",
      "text": "Качественный пользовательский интерфейс обеспечивает комфортное взаимодействие.",
      "ts": "2024-03-07T14:00:00Z"
    },
    {
      "id": "sub_090",
      "user_id": "user_010",
      "text": "Развитие вычислительной техники отражает прогресс технологической мысли.",
      "ts": "2024-03-07T15:00:00Z"
    },
    {
      "id": "sub_091",
      "user_id": "user_011",
      "text": "Без упорного труда невозможно выловить рыбку из пруда.",
      "ts": "2024-03-07T16:00:00Z"
    },
    {
      "id": "sub_092",
      "user_id": "user_012",
      "text": "Старый товарищ лучше новых двух в трудную минуту.",
      "ts": "2024-03-07T17:00:00Z"
    },
    {
      "id": "sub_093",
      "user_id": "user_013",
      "text": "Учение свет а неучение тьма для развития личности.",
      "ts": "2024-03-07T18:00:00Z"
    },
    {
      "id": "sub_094",
      "user_id": "user_014",
      "text": "Главное не прекращать задавать вопросы об окружающем мире.",
      "ts": "2024-03-07T19:00:00Z"
    },
    {
      "id": "sub_095",
      "user_id": "user_015",
      "text": "Не откладывай на завтра то что можно сделать сегодня.",
      "ts": "2024-03-07T20:00:00Z"
    },
    {
      "id": "sub_096",
      "user_id": "user_016",
      "text": "Простота высшая степень изощренности в программировании.",
      "ts": "2024-03-07T21:00:00Z"
    },
    {
      "id": "sub_097",
      "user_id": "user_017",
      "text": "Чистые функции не имеют побочных эффектов при выполнении.",
      "ts": "2024-03-07T22:00:00Z"
    },
    {
      "id": "sub_098",
      "user_id": "user_018",
      "text": "Массивы обеспечивают быстрый доступ к элементам по индексу.",
      "ts": "2024-03-07T23:00:00Z"
    },
    {
      "id": "sub_099",
      "user_id": "user_019",
      "text": "Каждый класс должен иметь только одну причину для изменения.",
      "ts": "2024-03-08T10:00:00Z"
    },
    {
      "id": "sub_100",
      "user_id": "user_020",
      "text": "Первая нормальная форма требует атомарности значений в таблице.",
      "ts": "2024-03-08T11:00:00Z"
    }
  ],
  "rules": [
    {
      "id": "rule_001",
      "kind": "min_length",
      "payload": {
        "min_chars": 50
      }
    },
    {
      "id": "rule_002",
      "kind": "similarity_threshold",
      "payload": {
        "threshold": 0.3
      }
    }
  ]
}
